#+DESCRIPTION: 用文学编程配置emacs
#+KEYWORDS: emacs,LP,Literal Programming,lisp,emacs config

#+BEGIN_SRC emacs-lisp :tangle no :results silent
(org-babel-tangle-file "steckemacs.org" "steckemacs.el" "emacs-lisp")
#+END_SRC

*** General Settings

#+BEGIN_SRC emacs-lisp
           (setq
            js-indent-level 2
            system-uses-terminfo nil
            desktop-save-mode 1
            inhibit-startup-message t
            backup-directory-alist `((".*" . ,temporary-file-directory)) ;don't clutter my fs and put backups into tmp
            auto-save-file-name-transforms `((".*" ,temporary-file-directory t))
            require-final-newline t          ;auto add newline at the end of file
            default-major-mode 'text-mode    ;use text mode per default
            history-length 250        ;default is 30
            locale-coding-system 'utf-8          ;utf-8 is default
            ;tab-always-indent 'complete          ;try to complete before identing
            confirm-nonexistent-file-or-buffer nil ;don't ask to create a buffer
            vc-follow-symlinks t                   ;follow symlinks automatically
            recentf-max-saved-items 5000           ;same up to 5000 recent files
            kill-ring-max 5000                     ;truncate kill ring after 5000 entries
            mark-ring-max 5000                     ;truncate mark ring after 5000 entries
            )
#+END_SRC

#+RESULTS:
: 5000

*** highlight-symbol

#+BEGIN_SRC emacs-lisp
(quelpa '(highlight-symbol :fetcher github :repo "nschum/highlight-symbol.el"))
  (setq highlight-symbol-on-navigation-p t)
(setq highlight-symbol-idle-delay 0.3)
  (add-hook 'prog-mode-hook 'highlight-symbol-mode)
#+END_SRC

#+RESULTS:
| highlight-symbol-mode |


*** org-mode

org-mode 真的非常非常非常强大工具,里面有markup, agenda, todo,
appointment, capture, babel, 光是文档就有278页. 现在流行的神马
wunderlist, day one, astrid, google keep 都弱爆了, 这才是真正的 GTD 工
具.

#+BEGIN_SRC emacs-lisp
                (setq org-directory "~/Dropbox/org")
                (quelpa '(ox-leanpub :repo "juanre/ox-leanpub" :fetcher github))
                (let ((todo "~/Dropbox/org/todo.org"))
                  (when (file-readable-p todo)
                    (setq org-agenda-files '("~/Dropbox/org/todo.org"))
                    (setq initial-buffer-choice (lambda ()
                                                  (org-agenda nil "n")
                                                  (delete-other-windows)
                                                  (current-buffer)
                                                  ))
                    ))
                (setq org-default-notes-file "~/Dropbox/org/refile.org")
                (setq org-mobile-inbox-for-pull "~/Dropbox/org/flagged.org")
                (setq org-mobile-directory "~/Dropbox/org/mobile")

                (add-to-list 'auto-mode-alist '("\\.org\\'" . org-mode))
                (add-to-list 'ac-modes 'org-mode)
                (setq org-startup-folded 'nofold)
                (setq org-startup-indented t)
                (setq org-startup-with-inline-images t)
                (setq org-startup-truncated t)
                (setq org-refile-targets '((org-agenda-files :maxlevel . 5)))
                (setq org-src-fontify-natively t)
                (setq org-src-tab-acts-natively t)
                (setq org-confirm-babel-evaluate nil)
                (setq org-use-speed-commands t)
                (setq org-default-notes-file (concat org-directory "/todo.org"))
                (setq org-capture-templates
                  '(
                     ("t" "Task" entry (file+headline "" "Tasks") "* TODO %?\n  %u\n  %a")
                     ("s" "Simple Task" entry (file+headline "" "Tasks") "* TODO %?\n  %U\n")
                     ))

                (add-to-list 'org-structure-template-alist '("E" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC\n"))
                (add-to-list 'org-structure-template-alist '("S" "#+BEGIN_SRC shell-script\n?\n#+END_SRC\n"))

                ;; minted
                (add-to-list 'org-latex-packages-alist '("" "minted"))
                (setq org-latex-listings 'minted)

                (setq org-latex-pdf-process
                  '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
                     "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
                     "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))

                (setq
                  appt-display-mode-line t     ; show in the modeline
                  appt-display-format 'window)
                (appt-activate 1)              ; activate appt (appointment notification)

                (org-agenda-to-appt)           ; add appointments on startup

                ;; add new appointments when saving the org buffer, use 'refresh argument to do it properly
                (add-hook 'org-mode-hook
                  (lambda ()
                    (add-hook 'after-save-hook '(lambda () (org-agenda-to-appt 'refresh)) nil 'make-it-local)
                    (yas-minor-mode -1)
                    (set (make-local-variable 'ac-auto-start) nil)
                    ))

                (setq appt-disp-window-function '(lambda (min-to-app new-time msg) (interactive)
                                                   (shell-command (concat "notify-send -i /usr/share/icons/gnome/32x32/status/appointment-soon.png '" (format "Appointment in %s min" min-to-app) "' '" msg "'")))
                  )
                ;; add state to the sorting strategy of todo
                (setcdr (assq 'todo org-agenda-sorting-strategy) '(todo-state-up priority-down category-keep))
                ;; define todo states: set time stamps one waiting, delegated and done
                (setq org-todo-keywords
                  '((sequence
                      "TODO(t)"
                      "IN PROGRESS(p!)"
                      "HOLD(h!)"
                      "WAITING(w)"
                      "SOMEDAY(s)"
                      "|"
                      "DONE(d!)"
                      "CANCELLED(c)"
                      )))
                (setq org-todo-keyword-faces
                  '(
                     ("IN PROGRESS" . 'warning)
                     ("HOLD" . 'font-lock-keyword-face)
                     ("WAITING" . 'font-lock-builtin-face)
                     ("SOMEDAY" . 'font-lock-doc-face)
                     ))
                                                        ; publish octopress blog
        (setq org-html-validation-link nil)
                (setq org-publish-project-alist
                  '(("emacs" .  (:base-directory "~/steckemacs"
                                   :base-extension "org"
                                   :publishing-directory "~/Dropbox/octopress/source/emacs/"
                                   :sub-superscript ""
                                   :recursive t
                                   :publishing-function org-html-publish-to-html
                                   :headline-levels 4
                                   :html-extension "markdown"
                                   :body-only t))
                     ("clojure-static"
                       :base-directory "~/Documents/Books/clojure-by-example/manuscript_org"
                       :base-extension "png\\|jpg\\|jpeg"
                       :publishing-directory "~/Documents/Books/clojure-by-example/manuscript"
                       :recursive t
                       :publishing-function org-publish-attachment)
                     ("clojure-md" :base-directory "~/Documents/Books/clojure-by-example/manuscript_org"
                       :base-extension "org"
                       :publishing-directory "~/Documents/Books/clojure-by-example/manuscript"
                       :sub-superscript ""
                       :recursive t
                       :publishing-function org-leanpub-publish-to-leanpub
                       :html-extension "md"
                       :body-only t)
                     ("clojure-book" :components ("clojure-md" "clojure-static"))
                     ("blog-notes"
                       ;; Directory for source files in org format
                       :base-directory "~/Dropbox/Public/blog/org/"
                       :base-extension "org"
                       :html-doctype "html5"
                       :html-head "<link rel=\"stylesheet\" href=\"/style/worg.css\" />"
                       :html-html5-fancy t
                       ;; HTML directory
                       :publishing-directory "~/Dropbox/Public/blog/public"
                       :publishing-function org-html-publish-to-html
                       :recursive t
                       :headline-levels 2
                       :section-numbers nil
                       :with-toc t
                       :html-link-up "/index.html"
                       :html-link-home "/~jichao.ouyang.html"
                       :auto-preamble t
                       :html-postamble-format "%a %d" ;write author and date at end
                       :auto-sitemap t
                       :sitemap-title "Jichao Ouyang's Blog"
                       :sitemap-filename "index"
                       :sitemap-sort-files anti-chronologically
                       :sitemap-file-entry-format "%t (%d)" ;write title and date in sitemap
                       )

                     ;; where static files (images, pdfs) are stored
                     ("blog-static"
                       :base-directory "~/Dropbox/Public/blog/org"
                       :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
                       :publishing-directory "~/Dropbox/Public/blog/public"
                  :recursive t
                  :publishing-function org-publish-attachment
                  )

                ("blog" :components ("blog-notes" "blog-static"))
                       ))
                      
#+END_SRC

#+RESULTS:
| emacs          | :base-directory | ~/steckemacs                                        | :base-extension | org  | :publishing-directory | ~/Dropbox/octopress/source/emacs/               | :sub-superscript      |                                                  | :recursive        | t    | :publishing-function  | org-html-publish-to-html       | :headline-levels      | 4                            | :html-extension | markdown | :body-only           | t                      |                  |     |           |   |               |             |                 |                      |                |   |                        |       |               |   |                |                      |                   |       |                     |                      |                            |         |
| clojure-static | :base-directory | ~/Documents/Books/clojure-by-example/manuscript_org | :base-extension | png\ | jpg\                  | jpeg                                            | :publishing-directory | ~/Documents/Books/clojure-by-example/manuscript  | :recursive        | t    | :publishing-function  | org-publish-attachment         |                       |                              |                 |          |                      |                        |                  |     |           |   |               |             |                 |                      |                |   |                        |       |               |   |                |                      |                   |       |                     |                      |                            |         |
| clojure-md     | :base-directory | ~/Documents/Books/clojure-by-example/manuscript_org | :base-extension | org  | :publishing-directory | ~/Documents/Books/clojure-by-example/manuscript | :sub-superscript      |                                                  | :recursive        | t    | :publishing-function  | org-leanpub-publish-to-leanpub | :html-extension       | md                           | :body-only      | t        |                      |                        |                  |     |           |   |               |             |                 |                      |                |   |                        |       |               |   |                |                      |                   |       |                     |                      |                            |         |
| clojure-book   | :components     | (clojure-md clojure-static)                         |                 |      |                       |                                                 |                       |                                                  |                   |      |                       |                                |                       |                              |                 |          |                      |                        |                  |     |           |   |               |             |                 |                      |                |   |                        |       |               |   |                |                      |                   |       |                     |                      |                            |         |
| blog-notes     | :base-directory | ~/Dropbox/Public/blog/org/                          | :base-extension | org  | :html-doctype         | html5                                           | :html-head            | <link rel="stylesheet" href="/style/worg.css" /> | :html-html5-fancy | t    | :publishing-directory | ~/Dropbox/Public/blog/public   | :publishing-function  | org-html-publish-to-html     | :recursive      | t        | :headline-levels     | 2                      | :section-numbers | nil | :with-toc | t | :html-link-up | /index.html | :html-link-home | /~jichao.ouyang.html | :auto-preamble | t | :html-postamble-format | %a %d | :auto-sitemap | t | :sitemap-title | Jichao Ouyang's Blog | :sitemap-filename | index | :sitemap-sort-files | anti-chronologically | :sitemap-file-entry-format | %t (%d) |
| blog-static    | :base-directory | ~/Dropbox/Public/blog/org                           | :base-extension | css\ | js\                   | png\                                            | jpg\                  | gif\                                             | pdf\              | mp3\ | ogg\                  | swf                            | :publishing-directory | ~/Dropbox/Public/blog/public | :recursive      | t        | :publishing-function | org-publish-attachment |                  |     |           |   |               |             |                 |                      |                |   |                        |       |               |   |                |                      |                   |       |                     |                      |                            |         |
| blog           | :components     | (blog-notes blog-static)                            |                 |      |                       |                                                 |                       |                                                  |                   |      |                       |                                |                       |                              |                 |          |                      |                        |                  |     |           |   |               |             |                 |                      |                |   |                        |       |               |   |                |                      |                   |       |                     |                      |                            |         |


